# Check your files for data corruption
brew "chkbit"
# Modern, maintained replacement for ls
brew "eza"
# Library for manipulating PNG images
brew "libpng"
# XML-based font configuration API for X Windows
brew "fontconfig"
# GNU compiler collection
brew "gcc"
# GitHub command-line tool
brew "gh"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# General-purpose lossless data-compression library
brew "zlib"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
